nusschAngE/stm32h7xx/Hardware/lcd/lcd.c

#include "stm32h7xx.h"
#include "lcd.h"
#include "font_field.h"
#include "delay.h"

/* LCD backlight control gpio */
#define LCD_BK_GPIO     GPIOB
#define LCD_BK_PIN      GPIO_PIN_5

/* LCD fmc */
typedef struct
{
    volatile uint16_t LCD_REG;
    volatile uint16_t LCD_RAM;
}LCD_Typedef;

/* FMC_A18 -> LCD_RS 
*  FMC_NE1 -> LCD_CS 
*/
#define LCD_BASE    ((uint32_t)0x60000000 | 0x0007fffe)
#define LCD         ((LCD_Typedef*)LCD_BASE)

/* LCD scan direction */
typedef enum
{
    L2R_U2D = 0, 	
    L2R_D2U,	
    R2L_U2D,
    R2L_D2U,

    U2D_L2R,
    U2D_R2L,
    D2U_L2R,
    D2U_R2L,

    SCANDIR_NUM
}LCDScanDirection;

#define DEFAULT_SCANDIR  L2R_U2D 

/* LCD command defines */
#define NT35510_SLEEP_IN    ((uint16_t)0x1000)
#define NT35510_SLEEP_OUT   ((uint16_t)0x1100)
#define NT35510_DISP_OFF    ((uint16_t)0x2800)
#define NT35510_DISP_ON     ((uint16_t)0x2900)
#define NT35510_SET_COLUMN  ((uint16_t)0x2a00)
#define NT35510_SET_ROW     ((uint16_t)0x2b00)
#define NT35510_FLUSH_RAM   ((uint16_t)0x2c00)
#define NT35510_MADCTL		((uint16_t)0x3600)

/* LCD controller */
SRAM_HandleTypeDef SRAM_Handle;
/* LCD device struct */
LCD_Device lcdDev;
/* font */
#define FONT_GRAM_SIZE  ((uint16_t)32 * 32)
static LCD_COLOR FontGRAM[FONT_GRAM_SIZE];

/* STATIC 
*/
static void NT35510_write_reg(uint16_t reg);
static void NT35510_write_ram(uint16_t data);
static void NT35510_set_register(uint16_t reg, uint16_t data);
static void NT35510_set_window(uint16_t x, uint16_t y, uint16_t width, uint16_t height);
static void NT35510_flush_color(LCD_COLOR color, uint32_t size);
static void NT35510_flush_data(LCD_COLOR *pData, uint32_t size);
static void SRAM_FMC_Init(void);

/******************* PUBLIC FUNCTION ***********************/
/*
*   call in HAL_SRAM_Init();
*/
void HAL_SRAM_MspInit(SRAM_HandleTypeDef *hsram)
{
	GPIO_InitTypeDef GPIO_Init;	

    /* Peripheral clock enable */
	__HAL_RCC_FMC_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
	
	GPIO_Init.Pin = GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10 
							|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14 
							|GPIO_PIN_15;
	GPIO_Init.Mode = GPIO_MODE_AF_PP;
	GPIO_Init.Pull = GPIO_NOPULL;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_Init.Alternate = GPIO_AF12_FMC;
	HAL_GPIO_Init(GPIOE, &GPIO_Init);

	GPIO_Init.Pin = GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_13 
							|GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_0|GPIO_PIN_1 
							|GPIO_PIN_4|GPIO_PIN_5;
	GPIO_Init.Mode = GPIO_MODE_AF_PP;
	GPIO_Init.Pull = GPIO_NOPULL;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_Init.Alternate = GPIO_AF12_FMC;
	HAL_GPIO_Init(GPIOD, &GPIO_Init);

	GPIO_Init.Pin = GPIO_PIN_7;
	GPIO_Init.Mode = GPIO_MODE_AF_PP;
	GPIO_Init.Pull = GPIO_NOPULL;
	GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_Init.Alternate = GPIO_AF12_FMC;
	HAL_GPIO_Init(GPIOD, &GPIO_Init); 

    /* lcd backlight control pin */
    GPIO_Init.Pin = LCD_BK_PIN;        
    GPIO_Init.Mode = GPIO_MODE_OUTPUT_PP;  
    GPIO_Init.Pull = GPIO_PULLUP;        
    GPIO_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH; 
    HAL_GPIO_Init(LCD_BK_GPIO, &GPIO_Init); 
}

uint8_t LCD_Init(void)
{
    SRAM_FMC_Init();
    DelayUs(50000);

 	NT35510_set_register(0xF000,0x55);
	NT35510_set_register(0xF001,0xAA);
	NT35510_set_register(0xF002,0x52);
	NT35510_set_register(0xF003,0x08);
	NT35510_set_register(0xF004,0x01);
    //AVDD Set AVDD 5.2V
	NT35510_set_register(0xB000,0x0D);
	NT35510_set_register(0xB001,0x0D);
	NT35510_set_register(0xB002,0x0D);
	//AVDD ratio
	NT35510_set_register(0xB600,0x34);
	NT35510_set_register(0xB601,0x34);
	NT35510_set_register(0xB602,0x34);
    //AVEE -5.2V
	NT35510_set_register(0xB100,0x0D);
	NT35510_set_register(0xB101,0x0D);
	NT35510_set_register(0xB102,0x0D);
    //AVEE ratio
	NT35510_set_register(0xB700,0x34);
	NT35510_set_register(0xB701,0x34);
	NT35510_set_register(0xB702,0x34);
    //VCL -2.5V
	NT35510_set_register(0xB200,0x00);
	NT35510_set_register(0xB201,0x00);
	NT35510_set_register(0xB202,0x00);
    //VCL ratio
	NT35510_set_register(0xB800,0x24);
	NT35510_set_register(0xB801,0x24);
	NT35510_set_register(0xB802,0x24);
    //VGH 15V (Free pump)
	NT35510_set_register(0xBF00,0x01);
	NT35510_set_register(0xB300,0x0F);
	NT35510_set_register(0xB301,0x0F);
	NT35510_set_register(0xB302,0x0F);
    //VGH ratio
	NT35510_set_register(0xB900,0x34);
	NT35510_set_register(0xB901,0x34);
	NT35510_set_register(0xB902,0x34);
    //VGL_REG -10V
	NT35510_set_register(0xB500,0x08);
	NT35510_set_register(0xB501,0x08);
	NT35510_set_register(0xB502,0x08);
	NT35510_set_register(0xC200,0x03);
	//VGLX ratio
	NT35510_set_register(0xBA00,0x24);
	NT35510_set_register(0xBA01,0x24);
	NT35510_set_register(0xBA02,0x24);
	//VGMP/VGSP 4.5V/0V
	NT35510_set_register(0xBC00,0x00);
	NT35510_set_register(0xBC01,0x78);
	NT35510_set_register(0xBC02,0x00);
	//VGMN/VGSN -4.5V/0V
	NT35510_set_register(0xBD00,0x00);
	NT35510_set_register(0xBD01,0x78);
	NT35510_set_register(0xBD02,0x00);
	//VCOM
	NT35510_set_register(0xBE00,0x00);
	NT35510_set_register(0xBE01,0x64);
	//Gamma Setting
	NT35510_set_register(0xD100,0x00);
	NT35510_set_register(0xD101,0x33);
	NT35510_set_register(0xD102,0x00);
	NT35510_set_register(0xD103,0x34);
	NT35510_set_register(0xD104,0x00);
	NT35510_set_register(0xD105,0x3A);
	NT35510_set_register(0xD106,0x00);
	NT35510_set_register(0xD107,0x4A);
	NT35510_set_register(0xD108,0x00);
	NT35510_set_register(0xD109,0x5C);
	NT35510_set_register(0xD10A,0x00);
	NT35510_set_register(0xD10B,0x81);
	NT35510_set_register(0xD10C,0x00);
	NT35510_set_register(0xD10D,0xA6);
	NT35510_set_register(0xD10E,0x00);
	NT35510_set_register(0xD10F,0xE5);
	NT35510_set_register(0xD110,0x01);
	NT35510_set_register(0xD111,0x13);
	NT35510_set_register(0xD112,0x01);
	NT35510_set_register(0xD113,0x54);
	NT35510_set_register(0xD114,0x01);
	NT35510_set_register(0xD115,0x82);
	NT35510_set_register(0xD116,0x01);
	NT35510_set_register(0xD117,0xCA);
	NT35510_set_register(0xD118,0x02);
	NT35510_set_register(0xD119,0x00);
	NT35510_set_register(0xD11A,0x02);
	NT35510_set_register(0xD11B,0x01);
	NT35510_set_register(0xD11C,0x02);
	NT35510_set_register(0xD11D,0x34);
	NT35510_set_register(0xD11E,0x02);
	NT35510_set_register(0xD11F,0x67);
	NT35510_set_register(0xD120,0x02);
	NT35510_set_register(0xD121,0x84);
	NT35510_set_register(0xD122,0x02);
	NT35510_set_register(0xD123,0xA4);
	NT35510_set_register(0xD124,0x02);
	NT35510_set_register(0xD125,0xB7);
	NT35510_set_register(0xD126,0x02);
	NT35510_set_register(0xD127,0xCF);
	NT35510_set_register(0xD128,0x02);
	NT35510_set_register(0xD129,0xDE);
	NT35510_set_register(0xD12A,0x02);
	NT35510_set_register(0xD12B,0xF2);
	NT35510_set_register(0xD12C,0x02);
	NT35510_set_register(0xD12D,0xFE);
	NT35510_set_register(0xD12E,0x03);
	NT35510_set_register(0xD12F,0x10);
	NT35510_set_register(0xD130,0x03);
	NT35510_set_register(0xD131,0x33);
	NT35510_set_register(0xD132,0x03);
	NT35510_set_register(0xD133,0x6D);
	NT35510_set_register(0xD200,0x00);
	NT35510_set_register(0xD201,0x33);
	NT35510_set_register(0xD202,0x00);
	NT35510_set_register(0xD203,0x34);
	NT35510_set_register(0xD204,0x00);
	NT35510_set_register(0xD205,0x3A);
	NT35510_set_register(0xD206,0x00);
	NT35510_set_register(0xD207,0x4A);
	NT35510_set_register(0xD208,0x00);
	NT35510_set_register(0xD209,0x5C);
	NT35510_set_register(0xD20A,0x00);

