nusschAngE/stm32h7xx/Hardware/lcd/lcd.c
	NT35510_set_register(0xD20B,0x81);
	NT35510_set_register(0xD20C,0x00);
	NT35510_set_register(0xD20D,0xA6);
	NT35510_set_register(0xD20E,0x00);
	NT35510_set_register(0xD20F,0xE5);
	NT35510_set_register(0xD210,0x01);
	NT35510_set_register(0xD211,0x13);
	NT35510_set_register(0xD212,0x01);
	NT35510_set_register(0xD213,0x54);
	NT35510_set_register(0xD214,0x01);
	NT35510_set_register(0xD215,0x82);
	NT35510_set_register(0xD216,0x01);
	NT35510_set_register(0xD217,0xCA);
	NT35510_set_register(0xD218,0x02);
	NT35510_set_register(0xD219,0x00);
	NT35510_set_register(0xD21A,0x02);
	NT35510_set_register(0xD21B,0x01);
	NT35510_set_register(0xD21C,0x02);
	NT35510_set_register(0xD21D,0x34);
	NT35510_set_register(0xD21E,0x02);
	NT35510_set_register(0xD21F,0x67);
	NT35510_set_register(0xD220,0x02);
	NT35510_set_register(0xD221,0x84);
	NT35510_set_register(0xD222,0x02);
	NT35510_set_register(0xD223,0xA4);
	NT35510_set_register(0xD224,0x02);
	NT35510_set_register(0xD225,0xB7);
	NT35510_set_register(0xD226,0x02);
	NT35510_set_register(0xD227,0xCF);
	NT35510_set_register(0xD228,0x02);
	NT35510_set_register(0xD229,0xDE);
	NT35510_set_register(0xD22A,0x02);
	NT35510_set_register(0xD22B,0xF2);
	NT35510_set_register(0xD22C,0x02);
	NT35510_set_register(0xD22D,0xFE);
	NT35510_set_register(0xD22E,0x03);
	NT35510_set_register(0xD22F,0x10);
	NT35510_set_register(0xD230,0x03);
	NT35510_set_register(0xD231,0x33);
	NT35510_set_register(0xD232,0x03);
	NT35510_set_register(0xD233,0x6D);
	NT35510_set_register(0xD300,0x00);
	NT35510_set_register(0xD301,0x33);
	NT35510_set_register(0xD302,0x00);
	NT35510_set_register(0xD303,0x34);
	NT35510_set_register(0xD304,0x00);
	NT35510_set_register(0xD305,0x3A);
	NT35510_set_register(0xD306,0x00);
	NT35510_set_register(0xD307,0x4A);
	NT35510_set_register(0xD308,0x00);
	NT35510_set_register(0xD309,0x5C);
	NT35510_set_register(0xD30A,0x00);

	NT35510_set_register(0xD30B,0x81);
	NT35510_set_register(0xD30C,0x00);
	NT35510_set_register(0xD30D,0xA6);
	NT35510_set_register(0xD30E,0x00);
	NT35510_set_register(0xD30F,0xE5);
	NT35510_set_register(0xD310,0x01);
	NT35510_set_register(0xD311,0x13);
	NT35510_set_register(0xD312,0x01);
	NT35510_set_register(0xD313,0x54);
	NT35510_set_register(0xD314,0x01);
	NT35510_set_register(0xD315,0x82);
	NT35510_set_register(0xD316,0x01);
	NT35510_set_register(0xD317,0xCA);
	NT35510_set_register(0xD318,0x02);
	NT35510_set_register(0xD319,0x00);
	NT35510_set_register(0xD31A,0x02);
	NT35510_set_register(0xD31B,0x01);
	NT35510_set_register(0xD31C,0x02);
	NT35510_set_register(0xD31D,0x34);
	NT35510_set_register(0xD31E,0x02);
	NT35510_set_register(0xD31F,0x67);
	NT35510_set_register(0xD320,0x02);
	NT35510_set_register(0xD321,0x84);
	NT35510_set_register(0xD322,0x02);
	NT35510_set_register(0xD323,0xA4);
	NT35510_set_register(0xD324,0x02);
	NT35510_set_register(0xD325,0xB7);
	NT35510_set_register(0xD326,0x02);
	NT35510_set_register(0xD327,0xCF);
	NT35510_set_register(0xD328,0x02);
	NT35510_set_register(0xD329,0xDE);
	NT35510_set_register(0xD32A,0x02);
	NT35510_set_register(0xD32B,0xF2);
	NT35510_set_register(0xD32C,0x02);
	NT35510_set_register(0xD32D,0xFE);
	NT35510_set_register(0xD32E,0x03);
	NT35510_set_register(0xD32F,0x10);
	NT35510_set_register(0xD330,0x03);
	NT35510_set_register(0xD331,0x33);
	NT35510_set_register(0xD332,0x03);
	NT35510_set_register(0xD333,0x6D);
	NT35510_set_register(0xD400,0x00);
	NT35510_set_register(0xD401,0x33);
	NT35510_set_register(0xD402,0x00);
	NT35510_set_register(0xD403,0x34);
	NT35510_set_register(0xD404,0x00);
	NT35510_set_register(0xD405,0x3A);
	NT35510_set_register(0xD406,0x00);
	NT35510_set_register(0xD407,0x4A);
	NT35510_set_register(0xD408,0x00);
	NT35510_set_register(0xD409,0x5C);
	NT35510_set_register(0xD40A,0x00);
	NT35510_set_register(0xD40B,0x81);

	NT35510_set_register(0xD40C,0x00);
	NT35510_set_register(0xD40D,0xA6);
	NT35510_set_register(0xD40E,0x00);
	NT35510_set_register(0xD40F,0xE5);
	NT35510_set_register(0xD410,0x01);
	NT35510_set_register(0xD411,0x13);
	NT35510_set_register(0xD412,0x01);
	NT35510_set_register(0xD413,0x54);
	NT35510_set_register(0xD414,0x01);
	NT35510_set_register(0xD415,0x82);
	NT35510_set_register(0xD416,0x01);
	NT35510_set_register(0xD417,0xCA);
	NT35510_set_register(0xD418,0x02);
	NT35510_set_register(0xD419,0x00);
	NT35510_set_register(0xD41A,0x02);
	NT35510_set_register(0xD41B,0x01);
	NT35510_set_register(0xD41C,0x02);
	NT35510_set_register(0xD41D,0x34);
	NT35510_set_register(0xD41E,0x02);
	NT35510_set_register(0xD41F,0x67);
	NT35510_set_register(0xD420,0x02);
	NT35510_set_register(0xD421,0x84);
	NT35510_set_register(0xD422,0x02);
	NT35510_set_register(0xD423,0xA4);
	NT35510_set_register(0xD424,0x02);
	NT35510_set_register(0xD425,0xB7);
	NT35510_set_register(0xD426,0x02);
	NT35510_set_register(0xD427,0xCF);
	NT35510_set_register(0xD428,0x02);
	NT35510_set_register(0xD429,0xDE);
	NT35510_set_register(0xD42A,0x02);
	NT35510_set_register(0xD42B,0xF2);
	NT35510_set_register(0xD42C,0x02);
	NT35510_set_register(0xD42D,0xFE);
	NT35510_set_register(0xD42E,0x03);
	NT35510_set_register(0xD42F,0x10);
	NT35510_set_register(0xD430,0x03);
	NT35510_set_register(0xD431,0x33);
	NT35510_set_register(0xD432,0x03);
	NT35510_set_register(0xD433,0x6D);
	NT35510_set_register(0xD500,0x00);
	NT35510_set_register(0xD501,0x33);
	NT35510_set_register(0xD502,0x00);
	NT35510_set_register(0xD503,0x34);
	NT35510_set_register(0xD504,0x00);
	NT35510_set_register(0xD505,0x3A);
	NT35510_set_register(0xD506,0x00);
	NT35510_set_register(0xD507,0x4A);
	NT35510_set_register(0xD508,0x00);
	NT35510_set_register(0xD509,0x5C);
	NT35510_set_register(0xD50A,0x00);
	NT35510_set_register(0xD50B,0x81);

	NT35510_set_register(0xD50C,0x00);
	NT35510_set_register(0xD50D,0xA6);
	NT35510_set_register(0xD50E,0x00);
	NT35510_set_register(0xD50F,0xE5);
	NT35510_set_register(0xD510,0x01);
	NT35510_set_register(0xD511,0x13);
	NT35510_set_register(0xD512,0x01);
	NT35510_set_register(0xD513,0x54);
	NT35510_set_register(0xD514,0x01);
	NT35510_set_register(0xD515,0x82);
	NT35510_set_register(0xD516,0x01);
	NT35510_set_register(0xD517,0xCA);
	NT35510_set_register(0xD518,0x02);
	NT35510_set_register(0xD519,0x00);
	NT35510_set_register(0xD51A,0x02);
	NT35510_set_register(0xD51B,0x01);
	NT35510_set_register(0xD51C,0x02);
	NT35510_set_register(0xD51D,0x34);
	NT35510_set_register(0xD51E,0x02);
	NT35510_set_register(0xD51F,0x67);
	NT35510_set_register(0xD520,0x02);
	NT35510_set_register(0xD521,0x84);
	NT35510_set_register(0xD522,0x02);
	NT35510_set_register(0xD523,0xA4);
	NT35510_set_register(0xD524,0x02);
	NT35510_set_register(0xD525,0xB7);
	NT35510_set_register(0xD526,0x02);
	NT35510_set_register(0xD527,0xCF);
	NT35510_set_register(0xD528,0x02);
	NT35510_set_register(0xD529,0xDE);
	NT35510_set_register(0xD52A,0x02);
	NT35510_set_register(0xD52B,0xF2);
	NT35510_set_register(0xD52C,0x02);
	NT35510_set_register(0xD52D,0xFE);
	NT35510_set_register(0xD52E,0x03);
	NT35510_set_register(0xD52F,0x10);
	NT35510_set_register(0xD530,0x03);
	NT35510_set_register(0xD531,0x33);
	NT35510_set_register(0xD532,0x03);
	NT35510_set_register(0xD533,0x6D);
	NT35510_set_register(0xD600,0x00);
	NT35510_set_register(0xD601,0x33);
	NT35510_set_register(0xD602,0x00);
	NT35510_set_register(0xD603,0x34);
	NT35510_set_register(0xD604,0x00);
	NT35510_set_register(0xD605,0x3A);
	NT35510_set_register(0xD606,0x00);
	NT35510_set_register(0xD607,0x4A);
	NT35510_set_register(0xD608,0x00);
	NT35510_set_register(0xD609,0x5C);
	NT35510_set_register(0xD60A,0x00);
	NT35510_set_register(0xD60B,0x81);

