nusschAngE/stm32h7xx/Hardware/lcd/lcd.c
	NT35510_set_register(0xD60C,0x00);
	NT35510_set_register(0xD60D,0xA6);
	NT35510_set_register(0xD60E,0x00);
	NT35510_set_register(0xD60F,0xE5);
	NT35510_set_register(0xD610,0x01);
	NT35510_set_register(0xD611,0x13);
	NT35510_set_register(0xD612,0x01);
	NT35510_set_register(0xD613,0x54);
	NT35510_set_register(0xD614,0x01);
	NT35510_set_register(0xD615,0x82);
	NT35510_set_register(0xD616,0x01);
	NT35510_set_register(0xD617,0xCA);
	NT35510_set_register(0xD618,0x02);
	NT35510_set_register(0xD619,0x00);
	NT35510_set_register(0xD61A,0x02);
	NT35510_set_register(0xD61B,0x01);
	NT35510_set_register(0xD61C,0x02);
	NT35510_set_register(0xD61D,0x34);
	NT35510_set_register(0xD61E,0x02);
	NT35510_set_register(0xD61F,0x67);
	NT35510_set_register(0xD620,0x02);
	NT35510_set_register(0xD621,0x84);
	NT35510_set_register(0xD622,0x02);
	NT35510_set_register(0xD623,0xA4);
	NT35510_set_register(0xD624,0x02);
	NT35510_set_register(0xD625,0xB7);
	NT35510_set_register(0xD626,0x02);
	NT35510_set_register(0xD627,0xCF);
	NT35510_set_register(0xD628,0x02);
	NT35510_set_register(0xD629,0xDE);
	NT35510_set_register(0xD62A,0x02);
	NT35510_set_register(0xD62B,0xF2);
	NT35510_set_register(0xD62C,0x02);
	NT35510_set_register(0xD62D,0xFE);
	NT35510_set_register(0xD62E,0x03);
	NT35510_set_register(0xD62F,0x10);
	NT35510_set_register(0xD630,0x03);
	NT35510_set_register(0xD631,0x33);
	NT35510_set_register(0xD632,0x03);
	NT35510_set_register(0xD633,0x6D);
	//LV2 Page 0 enable
	NT35510_set_register(0xF000,0x55);
	NT35510_set_register(0xF001,0xAA);
	NT35510_set_register(0xF002,0x52);
	NT35510_set_register(0xF003,0x08);
	NT35510_set_register(0xF004,0x00);
	//Display control
	NT35510_set_register(0xB100, 0xCC);
	NT35510_set_register(0xB101, 0x00);
	//Source hold time
	NT35510_set_register(0xB600,0x05);
	//Gate EQ control
	NT35510_set_register(0xB700,0x70);
	NT35510_set_register(0xB701,0x70);
	//Source EQ control (Mode 2)
	NT35510_set_register(0xB800,0x01);
	NT35510_set_register(0xB801,0x03);
	NT35510_set_register(0xB802,0x03);
	NT35510_set_register(0xB803,0x03);
	//Inversion mode (2-dot)
	NT35510_set_register(0xBC00,0x02);
	NT35510_set_register(0xBC01,0x00);
	NT35510_set_register(0xBC02,0x00);
	//Timing control 4H w/ 4-delay
	NT35510_set_register(0xC900,0xD0);
	NT35510_set_register(0xC901,0x02);
	NT35510_set_register(0xC902,0x50);
	NT35510_set_register(0xC903,0x50);
	NT35510_set_register(0xC904,0x50);
	NT35510_set_register(0x3500,0x00);
	//NT35510_set_register(0x3600,0x00);
	NT35510_set_register(0x3A00,0x55);  //16-bit/pixel
	NT35510_write_reg(0x1100); //sleep out
    DelayUs(5000);
	NT35510_write_reg(0x2800); //display off

	lcdDev.id = 35510;
	lcdDev.dir = 0;
	lcdDev.width = DEFAULT_LCD_WIDTH;
	lcdDev.height = DEFAULT_LCD_HEIGHT;

    /* lcd device set on */
    LCD_SetScanDirection(DEFAULT_SCANDIR);
    LCD_SetBacklightOnOff(TRUE);
    LCD_SetOnOff(TRUE);
    //LCD_Clear(0x0000);//black
    LCD_FieldBlock(0, 0 , 480 , 800, 0x0000);

    return (1);
}

void LCD_SetOnOff(uint8_t on)
{
    NT35510_write_reg(on ? NT35510_DISP_ON : NT35510_DISP_OFF);
}

void LCD_SetBacklightOnOff(uint8_t on)
{
    HAL_GPIO_WritePin(LCD_BK_GPIO, LCD_BK_PIN, (on ? GPIO_PIN_SET : GPIO_PIN_RESET));
}

void LCD_SetScanDirection(uint8_t dir)
{
	uint16_t regval = 0;

	switch(dir)
	{
		case L2R_U2D:
			lcdDev.dir = L2R_U2D;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
	        regval |= (0<<7)|(0<<6)|(0<<5);
			break;
		case L2R_D2U:
		    lcdDev.dir = L2R_D2U;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
			regval |= (1<<7)|(0<<6)|(0<<5); 
			break;
		case R2L_U2D:
		    lcdDev.dir = R2L_U2D;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
			regval |= (0<<7)|(1<<6)|(0<<5); 
			break;
		case R2L_D2U:
		    lcdDev.dir = R2L_D2U;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
			regval |= (1<<7)|(1<<6)|(0<<5); 
			break;	 
		case U2D_L2R:
		    lcdDev.dir = U2D_L2R;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (0<<7)|(0<<6)|(1<<5); 
			break;
		case U2D_R2L:
		    lcdDev.dir = U2D_R2L;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (0<<7)|(1<<6)|(1<<5); 
			break;
		case D2U_L2R:
		    lcdDev.dir = D2U_L2R;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (1<<7)|(0<<6)|(1<<5); 
			break;
		case D2U_R2L:
		    lcdDev.dir = D2U_R2L;
	        lcdDev.width = DEFAULT_LCD_HEIGHT;
	        lcdDev.height = DEFAULT_LCD_WIDTH;
			regval |= (1<<7)|(1<<6)|(1<<5); 
            break;
        default:
	        lcdDev.dir = L2R_U2D;
	        lcdDev.width = DEFAULT_LCD_WIDTH;
	        lcdDev.height = DEFAULT_LCD_HEIGHT;
	        regval |= (0<<7)|(0<<6)|(0<<5);    
			break;	 
	}

	NT35510_set_register(NT35510_MADCTL, regval);
}

uint8_t LCD_SetWorkRegion(uint16_t x, uint16_t y, uint16_t w, uint16_t h)
{
    uint16_t tmp = 0;

    if((x >= lcdDev.width) || (y >= lcdDev.height))
        return (LCD_BC);

    /* start column */
    NT35510_set_register(NT35510_SET_COLUMN,     x >> 8);
    NT35510_set_register(NT35510_SET_COLUMN + 1, x & 0xff);
    /* end column */
    tmp = x + w - 1;
    NT35510_set_register(NT35510_SET_COLUMN + 2, tmp >> 8);
    NT35510_set_register(NT35510_SET_COLUMN + 3, tmp & 0xff);

    /* start row */
    NT35510_set_register(NT35510_SET_ROW,     y >> 8);
    NT35510_set_register(NT35510_SET_ROW + 1, y & 0xff);   
    /* end row */
    tmp = y + h - 1;
    NT35510_set_register(NT35510_SET_ROW + 2, tmp >> 8);
    NT35510_set_register(NT35510_SET_ROW + 3, tmp & 0xff);

    return (LCD_OK);
}

uint8_t LCD_FlushData(LCD_COLOR *pData, uint32_t size, uint8_t type)
{
    NT35510_write_reg(NT35510_FLUSH_RAM);

    while(size--)
    {
        LCD->LCD_RAM = *pData;
        /* picture */
        if(type == LCD_FLUSH_PBUFF) pData++;
    }    

    return (LCD_OK);
}

void LCD_Clear(LCD_COLOR color)
{
    uint32_t wSize = DEFAULT_LCD_WIDTH * DEFAULT_LCD_HEIGHT;

    NT35510_set_window(0, 0, lcdDev.width, lcdDev.height);
    NT35510_flush_color(color, wSize);
}

uint8_t LCD_FieldBlock(uint16_t x, uint16_t y, uint16_t width, uint16_t height, LCD_COLOR color)
{
    uint32_t wSize = width * height;

    if(x >= lcdDev.width || y >= lcdDev.height)
        return LCD_BC;

    NT35510_set_window(x, y, width, height);
    NT35510_flush_color(color, wSize);
    return LCD_OK;
}
    
uint8_t LCD_DrawPoint(uint16_t x, uint16_t y, LCD_COLOR color)
{
    if(x >= lcdDev.width || y >= lcdDev.height)
        return LCD_BC;

