nusschAngE/stm32h7xx/Hardware/lcd/lcd.c
    /* draw one point ,set start position only */
    NT35510_set_window(x, y, 1, 1);
    /* write to lcd */
    NT35510_write_reg(NT35510_FLUSH_RAM);
    NT35510_write_ram(color);
    return LCD_OK;
}

uint8_t LCD_ShowPicture(uint16_t x, uint16_t y, uint16_t width, uint16_t height, LCD_COLOR *pic)
{
    uint32_t wSize = width * height;

    if(x >= lcdDev.width || y >= lcdDev.height)
        return LCD_BC;

    /* write to lcd */    
    NT35510_set_window(x, y, width, height);
    NT35510_flush_data(pic, wSize);
    return LCD_OK;
}

uint8_t LCD_ShowChar(uint16_t x, uint16_t y, uint8_t ch, uint8_t font, LCD_COLOR fr, LCD_COLOR bg)
{
    uint32_t wSize = 0;

    if(x >= lcdDev.width || y >= lcdDev.height)
        return LCD_BC;

    /* field font to FontGRAM[]*/
    wSize = Field_FontGRAM_ASCII(FontGRAM, FONT_GRAM_SIZE, ch, font, fr, bg);
    if(wSize > 0)
    {
        /* write to lcd */
        NT35510_set_window(x, y, ASCFont[font].width, ASCFont[font].height);
        NT35510_flush_data(FontGRAM, wSize);
    
        return LCD_OK;
    }
    else
    {
        /* font error */
        return LCD_ERR;
    }
}

/* return number of bytes be written */
uint16_t LCD_ShowString(uint16_t x, uint16_t y, char* pStr, uint8_t font, LCD_COLOR fr, LCD_COLOR bg)
{
    uint16_t x0 = x, y0 = y;
    uint16_t bWrite = 0;

    if(x >= lcdDev.width || y >= lcdDev.height)
        return 0;

    while(pStr[bWrite] != '\0')
    {
        /* show one char */
        LCD_ShowChar(x, y, pStr[bWrite], font, fr, bg);
        /* set next char's column */
        x += ASCFont[font].width;
        /* go to next char */
        bWrite++;
        if(x >= lcdDev.width)
        {
            break;
        }
    }

    return bWrite;
}

/**************** PRIVATE FUNCTION *****************/

static void NT35510_write_reg(uint16_t reg)
{
    reg = reg;
    LCD->LCD_REG = reg;
}

static void NT35510_write_ram(uint16_t data)
{
    data = data;
    LCD->LCD_RAM = data;
}

static void NT35510_set_register(uint16_t reg, uint16_t data)
{
    reg = reg;
    LCD->LCD_REG = reg;
    data = data;
    LCD->LCD_RAM = data;
}

#if 0
static void NT35510_set_cursor(uint16_t x, uint16_t y)
{
    NT35510_set_register(NT35510_SET_COLUMN,     x >> 8);
    NT35510_set_register(NT35510_SET_COLUMN + 1, x & 0xff);

    NT35510_set_register(NT35510_SET_ROW,     y >> 8);
    NT35510_set_register(NT35510_SET_ROW + 1, y & 0xff);
}
#endif

static void NT35510_set_window(uint16_t x, uint16_t y, uint16_t width, uint16_t height)
{
    uint16_t tmp = 0;

    /* start column */
    NT35510_set_register(NT35510_SET_COLUMN,     x >> 8);
    NT35510_set_register(NT35510_SET_COLUMN + 1, x & 0xff);
    /* end column */
    tmp = x + width - 1;
    NT35510_set_register(NT35510_SET_COLUMN + 2, tmp >> 8);
    NT35510_set_register(NT35510_SET_COLUMN + 3, tmp & 0xff);

    /* start row */
    NT35510_set_register(NT35510_SET_ROW,     y >> 8);
    NT35510_set_register(NT35510_SET_ROW + 1, y & 0xff);   
    /* end row */
    tmp = y + height - 1;
    NT35510_set_register(NT35510_SET_ROW + 2, tmp >> 8);
    NT35510_set_register(NT35510_SET_ROW + 3, tmp & 0xff);
}

static void NT35510_flush_color(LCD_COLOR color, uint32_t size)
{
    NT35510_write_reg(NT35510_FLUSH_RAM);

    while(size--)
    {
        //color = color;
        LCD->LCD_RAM = color;
    }
}

static void NT35510_flush_data(LCD_COLOR *pData, uint32_t size)
{
    NT35510_write_reg(NT35510_FLUSH_RAM);

    while(size--)
    {
        LCD->LCD_RAM = *pData;
        pData++;
    }
}

/*  MPU LCD using SRAM controller
*/
static void SRAM_FMC_Init(void)
{
  	FMC_NORSRAM_TimingTypeDef ReadTiming;
  	FMC_NORSRAM_TimingTypeDef WriteTiming;

  	/** Perform the SRAM1 memory initialization sequence
  	*/
  	SRAM_Handle.Instance = FMC_NORSRAM_DEVICE;
  	SRAM_Handle.Extended = FMC_NORSRAM_EXTENDED_DEVICE;
 	/* hsram1.Init */
  	SRAM_Handle.Init.NSBank = FMC_NORSRAM_BANK1;
  	SRAM_Handle.Init.DataAddressMux = FMC_DATA_ADDRESS_MUX_DISABLE;
  	SRAM_Handle.Init.MemoryType = FMC_MEMORY_TYPE_SRAM;
  	SRAM_Handle.Init.MemoryDataWidth = FMC_NORSRAM_MEM_BUS_WIDTH_16;
  	SRAM_Handle.Init.BurstAccessMode = FMC_BURST_ACCESS_MODE_DISABLE;
  	SRAM_Handle.Init.WaitSignalPolarity = FMC_WAIT_SIGNAL_POLARITY_LOW;
  	SRAM_Handle.Init.WaitSignalActive = FMC_WAIT_TIMING_BEFORE_WS;
  	SRAM_Handle.Init.WriteOperation = FMC_WRITE_OPERATION_ENABLE;
  	SRAM_Handle.Init.WaitSignal = FMC_WAIT_SIGNAL_DISABLE;
  	SRAM_Handle.Init.ExtendedMode = FMC_EXTENDED_MODE_ENABLE;
  	SRAM_Handle.Init.AsynchronousWait = FMC_ASYNCHRONOUS_WAIT_DISABLE;
  	SRAM_Handle.Init.WriteBurst = FMC_WRITE_BURST_DISABLE;
  	SRAM_Handle.Init.ContinuousClock = FMC_CONTINUOUS_CLOCK_SYNC_ASYNC;
  	//SRAM_Handle.Init.WriteFifo = FMC_WRITE_FIFO_ENABLE;
  	//SRAM_Handle.Init.PageSize = FMC_PAGE_SIZE_NONE;

    /* current FMC clock frequecy is 200mhz[5ns]
    */
  	
  	/* ReadTiming 
  	*/
  	ReadTiming.AddressSetupTime = 15;
  	ReadTiming.AddressHoldTime = 1;
  	ReadTiming.DataSetupTime = 10;
  	//ReadTiming.BusTurnAroundDuration = 15;
  	//Timing.CLKDivision = 16;
  	//ReadTiming.DataLatency = 3;
  	ReadTiming.AccessMode = FMC_ACCESS_MODE_A;
  	
  	/* WriteTiming 
  	*/
  	WriteTiming.AddressSetupTime = 5;
  	WriteTiming.AddressHoldTime = 1;
  	WriteTiming.DataSetupTime = 4;
  	//WriteTiming.BusTurnAroundDuration = 15;
  	//Timing.CLKDivision = 16;
  	//WriteTiming.DataLatency = 3;
  	WriteTiming.AccessMode = FMC_ACCESS_MODE_A;

  	if (HAL_SRAM_Init(&SRAM_Handle, &ReadTiming, &WriteTiming) != HAL_OK)
  	{
    	//
  	}	 
}


